In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1= {
    "name": ["harry","Krishna","Uday"] ,
    "marks":[90,34,89],
    "city":["jaipur","chandigarh","Mumbai"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      name  marks        city
0    harry     90      jaipur
1  Krishna     34  chandigarh
2     Uday     89      Mumbai

In [5]:
df.to_csv("marks.csv")

In [6]:
df.to_csv("marks.csv", index=False)

In [7]:
df.head(2)

      name  marks        city
0    harry     90      jaipur
1  Krishna     34  chandigarh

In [8]:
df.tail(2)

      name  marks        city
1  Krishna     34  chandigarh
2     Uday     89      Mumbai

In [9]:
df.describe() # show different operations results on columns with integers

           marks
count   3.000000
mean   71.000000
std    32.046841
min    34.000000
25%    61.500000
50%    89.000000
75%    89.500000
max    90.000000

In [10]:
train = pd.read_csv('train.csv')

In [11]:
train

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  train_no  speed    junction
0             0             0           0     12345     90      jaipur
1             1             1           1    123435    161  chandigarh
2             2             2           2     12354    110      Mumbai
3             3             3           3     12324    134       Delhi

In [12]:
train['speed']

0     90
1    161
2    110
3    134
Name: speed, dtype: int64

In [13]:
train['speed'][2]

110

In [14]:
train['speed'][2] = 110

C:\Users\Hp\AppData\Local\Temp\ipykernel_13136\3340488298.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['speed'][2] = 110

In [15]:
train

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  train_no  speed    junction
0             0             0           0     12345     90      jaipur
1             1             1           1    123435    161  chandigarh
2             2             2           2     12354    110      Mumbai
3             3             3           3     12324    134       Delhi

In [16]:
train.to_csv("train.csv")

In [17]:
train.index = ["1st","2nd","3rd","4th"]

In [18]:
train

     Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  train_no  speed    junction
1st             0             0           0     12345     90      jaipur
2nd             1             1           1    123435    161  chandigarh
3rd             2             2           2     12354    110      Mumbai
4th             3             3           3     12324    134       Delhi

In [19]:
ser = pd.Series(np.random.rand(20))

In [20]:
ser

0     0.547006
1     0.449771
2     0.530496
3     0.499640
4     0.924193
5     0.241641
6     0.133082
7     0.367501
8     0.270833
9     0.074617
10    0.597982
11    0.465713
12    0.117529
13    0.418408
14    0.421416
15    0.614007
16    0.268408
17    0.946963
18    0.119988
19    0.407553
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [22]:
newdf = pd.DataFrame(np.random.randn(500,4) , index = np.arange(500)) #.rand or.randn

In [23]:
newdf.head()

          0         1         2         3
0  0.561210  1.347296 -0.110561  0.390979
1 -0.066288  0.239746 -0.044103 -1.312968
2  1.333369  0.923440  1.161336  0.580655
3 -1.281352 -0.233748 -0.611803  0.680043
4  0.549045 -0.627046 -1.131199  0.553392

In [24]:
newdf.tail(20)

            0         1         2         3
480  2.680487  2.168075 -0.917038  0.011785
481 -1.945221 -0.914398  2.052724 -0.148241
482  1.777270  0.736705  0.455285 -0.055736
483  0.072843  0.651898  0.879804 -0.346832
484  0.891128  0.013437 -0.915291  0.129590
485  0.908628  0.041513  0.791988 -0.102925
486 -0.759009 -0.460741  1.330716  0.514187
487 -2.355224 -0.015005 -0.080287  0.203291
488  0.578078  1.380586  0.466323  0.671853
489 -0.109946 -1.220892  2.631768 -1.085866
490 -0.360901  0.900821  1.057565 -0.533359
491 -1.601389  0.314242  0.052432 -0.340759
492 -0.327292  0.817674  1.559708 -0.207471
493  0.414495 -0.017705 -0.264248  0.193438
494 -1.087073 -0.055578 -0.274915  0.362112
495 -0.661960  0.771746 -0.034122  0.327055
496 -1.067010 -1.014601  0.039700  0.086324
497  1.449347  2.389489  0.726469  1.784006
498 -0.839853  0.268085 -1.228992 -0.285118
499 -0.158926  1.315866  0.235817  1.144335

In [25]:
type(newdf)

pandas.core.frame.DataFrame

In [26]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
dtype: object

In [27]:
newdf[0][0] = "Krishna"

In [28]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
dtype: object

In [29]:
newdf

            0         1         2         3
0     Krishna  1.347296 -0.110561  0.390979
1   -0.066288  0.239746 -0.044103 -1.312968
2    1.333369  0.923440  1.161336  0.580655
3   -1.281352 -0.233748 -0.611803  0.680043
4    0.549045 -0.627046 -1.131199  0.553392
..        ...       ...       ...       ...
495  -0.66196  0.771746 -0.034122  0.327055
496  -1.06701 -1.014601  0.039700  0.086324
497  1.449347  2.389489  0.726469  1.784006
498 -0.839853  0.268085 -1.228992 -0.285118
499 -0.158926  1.315866  0.235817  1.144335

[500 rows x 4 columns]

In [30]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            490, 491, 492, 493, 494, 495, 496, 497, 498, 499],
           dtype='int64', length=500)

In [31]:
newdf.columns

RangeIndex(start=0, stop=4, step=1)

In [32]:
newdf.to_numpy()

array([['Krishna', 1.3472956569238632, -0.1105611935022308,
        0.39097896621835976],
       [-0.06628815878285937, 0.23974550384110616, -0.04410253265233983,
        -1.3129683938708872],
       [1.3333689942115492, 0.9234403052961816, 1.1613360348442714,
        0.5806553390266315],
       ...,
       [1.4493465208248202, 2.3894891414236343, 0.7264693247433096,
        1.7840061744903284],
       [-0.8398525529749833, 0.26808521395459395, -1.2289918192162206,
        -0.2851180951288032],
       [-0.1589257191236218, 1.3158663994279933, 0.23581705901197808,
        1.1443348680192522]], dtype=object)

In [33]:
newdf[0][0] = 93094

In [34]:
newdf.T #transpose of matrix

,0,1,2,3,4,5,6,7,8,9,...,490,491,492,493,494,495,496,497,498,499
0,93094,-0.066288,1.333369,-1.281352,0.549045,0.996921,0.533032,1.437602,0.824628,0.595165,...,-0.360901,-1.601389,-0.327292,0.414495,-1.087073,-0.66196,-1.06701,1.449347,-0.839853,-0.158926
1,1.347296,0.239746,0.92344,-0.233748,-0.627046,0.189515,-0.866146,-1.255676,0.066153,-0.467938,...,0.900821,0.314242,0.817674,-0.017705,-0.055578,0.771746,-1.014601,2.389489,0.268085,1.315866
2,-0.110561,-0.044103,1.161336,-0.611803,-1.131199,0.919685,0.262594,1.859433,-1.072376,-0.625746,...,1.057565,0.052432,1.559708,-0.264248,-0.274915,-0.034122,0.0397,0.726469,-1.228992,0.235817
3,0.390979,-1.312968,0.580655,0.680043,0.553392,-1.450474,-0.463132,0.680306,0.407583,1.604645,...,-0.533359,-0.340759,-0.207471,0.193438,0.362112,0.327055,0.086324,1.784006,-0.285118,1.144335

In [35]:
newdf.sort_index(axis = 1 , ascending = False) #axis  = 0 (row) , axis = 1 (columns)

            3         2         1         0
0    0.390979 -0.110561  1.347296     93094
1   -1.312968 -0.044103  0.239746 -0.066288
2    0.580655  1.161336  0.923440  1.333369
3    0.680043 -0.611803 -0.233748 -1.281352
4    0.553392 -1.131199 -0.627046  0.549045
..        ...       ...       ...       ...
495  0.327055 -0.034122  0.771746  -0.66196
496  0.086324  0.039700 -1.014601  -1.06701
497  1.784006  0.726469  2.389489  1.449347
498 -0.285118 -1.228992  0.268085 -0.839853
499  1.144335  0.235817  1.315866 -0.158926

[500 rows x 4 columns]

In [36]:
newdf2 = newdf #it will generated the mirror image of the newdf and the changes in newdf2 will lead tp change newdf to

In [37]:
newdf2 = newdf.copy()  #this will generate the copy of newdf

In [38]:
newdf2[0][0] = "Krishna"

C:\Users\Hp\AppData\Local\Temp\ipykernel_13136\2233157739.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = "Krishna"

In [39]:
newdf

            0         1         2         3
0       93094  1.347296 -0.110561  0.390979
1   -0.066288  0.239746 -0.044103 -1.312968
2    1.333369  0.923440  1.161336  0.580655
3   -1.281352 -0.233748 -0.611803  0.680043
4    0.549045 -0.627046 -1.131199  0.553392
..        ...       ...       ...       ...
495  -0.66196  0.771746 -0.034122  0.327055
496  -1.06701 -1.014601  0.039700  0.086324
497  1.449347  2.389489  0.726469  1.784006
498 -0.839853  0.268085 -1.228992 -0.285118
499 -0.158926  1.315866  0.235817  1.144335

[500 rows x 4 columns]

In [40]:
newdf2

            0         1         2         3
0     Krishna  1.347296 -0.110561  0.390979
1   -0.066288  0.239746 -0.044103 -1.312968
2    1.333369  0.923440  1.161336  0.580655
3   -1.281352 -0.233748 -0.611803  0.680043
4    0.549045 -0.627046 -1.131199  0.553392
..        ...       ...       ...       ...
495  -0.66196  0.771746 -0.034122  0.327055
496  -1.06701 -1.014601  0.039700  0.086324
497  1.449347  2.389489  0.726469  1.784006
498 -0.839853  0.268085 -1.228992 -0.285118
499 -0.158926  1.315866  0.235817  1.144335

[500 rows x 4 columns]

In [41]:
newdf.loc[0,0] = "Krishna" #this is the correct method to allocate the values in array not newdef[0][0]

In [42]:
newdf

            0         1         2         3
0     Krishna  1.347296 -0.110561  0.390979
1   -0.066288  0.239746 -0.044103 -1.312968
2    1.333369  0.923440  1.161336  0.580655
3   -1.281352 -0.233748 -0.611803  0.680043
4    0.549045 -0.627046 -1.131199  0.553392
..        ...       ...       ...       ...
495  -0.66196  0.771746 -0.034122  0.327055
496  -1.06701 -1.014601  0.039700  0.086324
497  1.449347  2.389489  0.726469  1.784006
498 -0.839853  0.268085 -1.228992 -0.285118
499 -0.158926  1.315866  0.235817  1.144335

[500 rows x 4 columns]

In [43]:
newdf.columns = [0 , 1 , 2, 3]

In [44]:
newdf

            0         1         2         3
0     Krishna  1.347296 -0.110561  0.390979
1   -0.066288  0.239746 -0.044103 -1.312968
2    1.333369  0.923440  1.161336  0.580655
3   -1.281352 -0.233748 -0.611803  0.680043
4    0.549045 -0.627046 -1.131199  0.553392
..        ...       ...       ...       ...
495  -0.66196  0.771746 -0.034122  0.327055
496  -1.06701 -1.014601  0.039700  0.086324
497  1.449347  2.389489  0.726469  1.784006
498 -0.839853  0.268085 -1.228992 -0.285118
499 -0.158926  1.315866  0.235817  1.144335

[500 rows x 4 columns]

In [45]:
newdf = newdf.drop(3 , axis =1)

In [46]:
newdf

            0         1         2
0     Krishna  1.347296 -0.110561
1   -0.066288  0.239746 -0.044103
2    1.333369  0.923440  1.161336
3   -1.281352 -0.233748 -0.611803
4    0.549045 -0.627046 -1.131199
..        ...       ...       ...
495  -0.66196  0.771746 -0.034122
496  -1.06701 -1.014601  0.039700
497  1.449347  2.389489  0.726469
498 -0.839853  0.268085 -1.228992
499 -0.158926  1.315866  0.235817

[500 rows x 3 columns]

In [47]:
newdf.loc[[1,4] , [1,2]] #it will return us the respective table

          1         2
1  0.239746 -0.044103
4 -0.627046 -1.131199

In [48]:
newdf.loc[: ,[0,2]]

            0         2
0     Krishna -0.110561
1   -0.066288 -0.044103
2    1.333369  1.161336
3   -1.281352 -0.611803
4    0.549045 -1.131199
..        ...       ...
495  -0.66196 -0.034122
496  -1.06701  0.039700
497  1.449347  0.726469
498 -0.839853 -1.228992
499 -0.158926  0.235817

[500 rows x 2 columns]

In [49]:
newdf.loc[0,0] = 0.1

In [50]:
newdf

            0         1         2
0         0.1  1.347296 -0.110561
1   -0.066288  0.239746 -0.044103
2    1.333369  0.923440  1.161336
3   -1.281352 -0.233748 -0.611803
4    0.549045 -0.627046 -1.131199
..        ...       ...       ...
495  -0.66196  0.771746 -0.034122
496  -1.06701 -1.014601  0.039700
497  1.449347  2.389489  0.726469
498 -0.839853  0.268085 -1.228992
499 -0.158926  1.315866  0.235817

[500 rows x 3 columns]

In [51]:
newdf.loc[(newdf[0]>1)  &  (newdf[2]<-0.5)] #like a query for table , return the table respective to condition

            0         1         2
36   1.119672  0.362134 -0.557359
65    1.37073 -0.334948 -0.598254
92   1.572658 -0.333882 -0.573213
97   2.247411 -0.224179 -1.151436
114  2.090219 -0.647680 -0.977068
127  1.191829  0.204394 -1.739367
143  1.077002  0.330742 -0.621066
156  1.430977  1.424618 -1.556975
163  1.409309  0.013910 -0.518458
177  1.112705  2.170751 -1.688599
178  1.243967 -0.723001 -1.541426
241  1.390487  0.667199 -0.654862
273  1.391012  0.743122 -2.153929
280  1.794316  0.854717 -0.552097
294  1.225288  1.868948 -0.555731
339  1.150487  1.750561 -2.229326
343  1.261174 -0.214763 -0.728004
358  1.043715 -1.377479 -0.824027
369  1.313421  0.705723 -2.090960
403  1.143586 -1.594760 -0.803021
426  1.491644 -1.680845 -0.923077
451  1.308024  1.467662 -2.009781
480  2.680487  2.168075 -0.917038

In [52]:
newdf.iloc[0,2] # this iloc function is used when u can fetch table by index number but not index name

-0.1105611935022308

In [53]:
newdf.drop([0,3,4] , inplace =True) #inplace is used to make changes in original dataframe

In [54]:
newdf

            0         1         2
1   -0.066288  0.239746 -0.044103
2    1.333369  0.923440  1.161336
5    0.996921  0.189515  0.919685
6    0.533032 -0.866146  0.262594
7    1.437602 -1.255676  1.859433
..        ...       ...       ...
495  -0.66196  0.771746 -0.034122
496  -1.06701 -1.014601  0.039700
497  1.449347  2.389489  0.726469
498 -0.839853  0.268085 -1.228992
499 -0.158926  1.315866  0.235817

[497 rows x 3 columns]

In [55]:
newdf.reset_index(drop = True , inplace =True) # to reset the index numbe

In [56]:
newdf[1].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
492    False
493    False
494    False
495    False
496    False
Name: 1, Length: 497, dtype: bool

In [57]:
intdf = pd.DataFrame([123, 234 ,345] ,
        [123, 234 ,345])

In [58]:
intdf

       0
123  123
234  234
345  345

In [59]:
newdf

            0         1         2
0   -0.066288  0.239746 -0.044103
1    1.333369  0.923440  1.161336
2    0.996921  0.189515  0.919685
3    0.533032 -0.866146  0.262594
4    1.437602 -1.255676  1.859433
..        ...       ...       ...
492  -0.66196  0.771746 -0.034122
493  -1.06701 -1.014601  0.039700
494  1.449347  2.389489  0.726469
495 -0.839853  0.268085 -1.228992
496 -0.158926  1.315866  0.235817

[497 rows x 3 columns]

In [60]:
newdf.columns = list('ABC')

In [61]:
newdf.iloc[3 , 2]

0.26259368089361285